; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l9-t1-p2---int100n150-m25---int100c200---s78---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level11 level11)
(sum level0 level13 level13)
(sum level0 level17 level17)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level11 level12)
(sum level1 level13 level14)
(sum level1 level17 level18)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level11 level13)
(sum level2 level13 level15)
(sum level2 level17 level19)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level11 level14)
(sum level3 level13 level16)
(sum level3 level17 level20)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level11 level15)
(sum level4 level13 level17)
(sum level4 level17 level21)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level22 level26)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level11 level16)
(sum level5 level13 level18)
(sum level5 level17 level22)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level22 level27)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level11 level17)
(sum level6 level13 level19)
(sum level6 level17 level23)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level22 level28)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level11 level18)
(sum level7 level13 level20)
(sum level7 level17 level24)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level22 level29)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level11 level19)
(sum level8 level13 level21)
(sum level8 level17 level25)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level22 level30)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level11 level20)
(sum level9 level13 level22)
(sum level9 level17 level26)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level22 level31)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level11 level21)
(sum level10 level13 level23)
(sum level10 level17 level27)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level22 level32)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level11 level22)
(sum level11 level13 level24)
(sum level11 level17 level28)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level22 level33)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level11 level23)
(sum level12 level13 level25)
(sum level12 level17 level29)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level22 level34)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level11 level24)
(sum level13 level13 level26)
(sum level13 level17 level30)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level22 level35)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level11 level25)
(sum level14 level13 level27)
(sum level14 level17 level31)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level22 level36)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level11 level26)
(sum level15 level13 level28)
(sum level15 level17 level32)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level22 level37)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level11 level27)
(sum level16 level13 level29)
(sum level16 level17 level33)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level22 level38)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level11 level28)
(sum level17 level13 level30)
(sum level17 level17 level34)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level22 level39)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level11 level29)
(sum level18 level13 level31)
(sum level18 level17 level35)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level22 level40)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level11 level30)
(sum level19 level13 level32)
(sum level19 level17 level36)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level22 level41)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level11 level31)
(sum level20 level13 level33)
(sum level20 level17 level37)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level22 level42)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level11 level32)
(sum level21 level13 level34)
(sum level21 level17 level38)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level22 level43)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level11 level33)
(sum level22 level13 level35)
(sum level22 level17 level39)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level22 level44)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level11 level34)
(sum level23 level13 level36)
(sum level23 level17 level40)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level22 level45)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level11 level35)
(sum level24 level13 level37)
(sum level24 level17 level41)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level22 level46)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level11 level36)
(sum level25 level13 level38)
(sum level25 level17 level42)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level22 level47)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level11 level37)
(sum level26 level13 level39)
(sum level26 level17 level43)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level22 level48)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level11 level38)
(sum level27 level13 level40)
(sum level27 level17 level44)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level22 level49)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level11 level39)
(sum level28 level13 level41)
(sum level28 level17 level45)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level28 level22 level50)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level11 level40)
(sum level29 level13 level42)
(sum level29 level17 level46)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level29 level22 level51)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level11 level41)
(sum level30 level13 level43)
(sum level30 level17 level47)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level30 level22 level52)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level11 level42)
(sum level31 level13 level44)
(sum level31 level17 level48)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level31 level22 level53)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level11 level43)
(sum level32 level13 level45)
(sum level32 level17 level49)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level32 level22 level54)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level11 level44)
(sum level33 level13 level46)
(sum level33 level17 level50)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level33 level22 level55)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level11 level45)
(sum level34 level13 level47)
(sum level34 level17 level51)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level34 level22 level56)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level11 level46)
(sum level35 level13 level48)
(sum level35 level17 level52)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level35 level22 level57)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level11 level47)
(sum level36 level13 level49)
(sum level36 level17 level53)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level36 level22 level58)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level11 level48)
(sum level37 level13 level50)
(sum level37 level17 level54)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level37 level22 level59)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level11 level49)
(sum level38 level13 level51)
(sum level38 level17 level55)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level38 level22 level60)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level11 level50)
(sum level39 level13 level52)
(sum level39 level17 level56)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level39 level22 level61)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level11 level51)
(sum level40 level13 level53)
(sum level40 level17 level57)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level40 level22 level62)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level11 level52)
(sum level41 level13 level54)
(sum level41 level17 level58)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level41 level22 level63)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level11 level53)
(sum level42 level13 level55)
(sum level42 level17 level59)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level42 level22 level64)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level11 level54)
(sum level43 level13 level56)
(sum level43 level17 level60)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level43 level22 level65)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level11 level55)
(sum level44 level13 level57)
(sum level44 level17 level61)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level44 level22 level66)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level11 level56)
(sum level45 level13 level58)
(sum level45 level17 level62)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level45 level22 level67)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level11 level57)
(sum level46 level13 level59)
(sum level46 level17 level63)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level46 level22 level68)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level11 level58)
(sum level47 level13 level60)
(sum level47 level17 level64)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level47 level22 level69)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level11 level59)
(sum level48 level13 level61)
(sum level48 level17 level65)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level48 level22 level70)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level11 level60)
(sum level49 level13 level62)
(sum level49 level17 level66)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level49 level22 level71)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level11 level61)
(sum level50 level13 level63)
(sum level50 level17 level67)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level50 level22 level72)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level11 level62)
(sum level51 level13 level64)
(sum level51 level17 level68)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level51 level22 level73)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level11 level63)
(sum level52 level13 level65)
(sum level52 level17 level69)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level52 level22 level74)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level11 level64)
(sum level53 level13 level66)
(sum level53 level17 level70)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level53 level22 level75)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level11 level65)
(sum level54 level13 level67)
(sum level54 level17 level71)
(sum level54 level19 level73)
(sum level54 level20 level74)
(sum level54 level22 level76)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level11 level66)
(sum level55 level13 level68)
(sum level55 level17 level72)
(sum level55 level19 level74)
(sum level55 level20 level75)
(sum level55 level22 level77)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level11 level67)
(sum level56 level13 level69)
(sum level56 level17 level73)
(sum level56 level19 level75)
(sum level56 level20 level76)
(sum level56 level22 level78)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level11 level68)
(sum level57 level13 level70)
(sum level57 level17 level74)
(sum level57 level19 level76)
(sum level57 level20 level77)
(sum level57 level22 level79)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level4 level62)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level58 level11 level69)
(sum level58 level13 level71)
(sum level58 level17 level75)
(sum level58 level19 level77)
(sum level58 level20 level78)
(sum level58 level22 level80)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level4 level63)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level59 level11 level70)
(sum level59 level13 level72)
(sum level59 level17 level76)
(sum level59 level19 level78)
(sum level59 level20 level79)
(sum level59 level22 level81)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level4 level64)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level60 level11 level71)
(sum level60 level13 level73)
(sum level60 level17 level77)
(sum level60 level19 level79)
(sum level60 level20 level80)
(sum level60 level22 level82)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level4 level65)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level61 level11 level72)
(sum level61 level13 level74)
(sum level61 level17 level78)
(sum level61 level19 level80)
(sum level61 level20 level81)
(sum level61 level22 level83)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level4 level66)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level62 level7 level69)
(sum level62 level11 level73)
(sum level62 level13 level75)
(sum level62 level17 level79)
(sum level62 level19 level81)
(sum level62 level20 level82)
(sum level62 level22 level84)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level4 level67)
(sum level63 level5 level68)
(sum level63 level6 level69)
(sum level63 level7 level70)
(sum level63 level11 level74)
(sum level63 level13 level76)
(sum level63 level17 level80)
(sum level63 level19 level82)
(sum level63 level20 level83)
(sum level63 level22 level85)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level4 level68)
(sum level64 level5 level69)
(sum level64 level6 level70)
(sum level64 level7 level71)
(sum level64 level11 level75)
(sum level64 level13 level77)
(sum level64 level17 level81)
(sum level64 level19 level83)
(sum level64 level20 level84)
(sum level64 level22 level86)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level4 level69)
(sum level65 level5 level70)
(sum level65 level6 level71)
(sum level65 level7 level72)
(sum level65 level11 level76)
(sum level65 level13 level78)
(sum level65 level17 level82)
(sum level65 level19 level84)
(sum level65 level20 level85)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level4 level70)
(sum level66 level5 level71)
(sum level66 level6 level72)
(sum level66 level7 level73)
(sum level66 level11 level77)
(sum level66 level13 level79)
(sum level66 level17 level83)
(sum level66 level19 level85)
(sum level66 level20 level86)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level4 level71)
(sum level67 level5 level72)
(sum level67 level6 level73)
(sum level67 level7 level74)
(sum level67 level11 level78)
(sum level67 level13 level80)
(sum level67 level17 level84)
(sum level67 level19 level86)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level4 level72)
(sum level68 level5 level73)
(sum level68 level6 level74)
(sum level68 level7 level75)
(sum level68 level11 level79)
(sum level68 level13 level81)
(sum level68 level17 level85)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level69 level4 level73)
(sum level69 level5 level74)
(sum level69 level6 level75)
(sum level69 level7 level76)
(sum level69 level11 level80)
(sum level69 level13 level82)
(sum level69 level17 level86)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level70 level4 level74)
(sum level70 level5 level75)
(sum level70 level6 level76)
(sum level70 level7 level77)
(sum level70 level11 level81)
(sum level70 level13 level83)
(sum level71 level2 level73)
(sum level71 level3 level74)
(sum level71 level4 level75)
(sum level71 level5 level76)
(sum level71 level6 level77)
(sum level71 level7 level78)
(sum level71 level11 level82)
(sum level71 level13 level84)
(sum level72 level2 level74)
(sum level72 level3 level75)
(sum level72 level4 level76)
(sum level72 level5 level77)
(sum level72 level6 level78)
(sum level72 level7 level79)
(sum level72 level11 level83)
(sum level72 level13 level85)
(sum level73 level2 level75)
(sum level73 level3 level76)
(sum level73 level4 level77)
(sum level73 level5 level78)
(sum level73 level6 level79)
(sum level73 level7 level80)
(sum level73 level11 level84)
(sum level73 level13 level86)
(sum level74 level2 level76)
(sum level74 level3 level77)
(sum level74 level4 level78)
(sum level74 level5 level79)
(sum level74 level6 level80)
(sum level74 level7 level81)
(sum level74 level11 level85)
(sum level75 level2 level77)
(sum level75 level3 level78)
(sum level75 level4 level79)
(sum level75 level5 level80)
(sum level75 level6 level81)
(sum level75 level7 level82)
(sum level75 level11 level86)
(sum level76 level2 level78)
(sum level76 level3 level79)
(sum level76 level4 level80)
(sum level76 level5 level81)
(sum level76 level6 level82)
(sum level76 level7 level83)
(sum level77 level2 level79)
(sum level77 level3 level80)
(sum level77 level4 level81)
(sum level77 level5 level82)
(sum level77 level6 level83)
(sum level77 level7 level84)
(sum level78 level2 level80)
(sum level78 level3 level81)
(sum level78 level4 level82)
(sum level78 level5 level83)
(sum level78 level6 level84)
(sum level78 level7 level85)
(sum level79 level2 level81)
(sum level79 level3 level82)
(sum level79 level4 level83)
(sum level79 level5 level84)
(sum level79 level6 level85)
(sum level79 level7 level86)
(sum level80 level2 level82)
(sum level80 level3 level83)
(sum level80 level4 level84)
(sum level80 level5 level85)
(sum level80 level6 level86)
(sum level81 level2 level83)
(sum level81 level3 level84)
(sum level81 level4 level85)
(sum level81 level5 level86)
(sum level82 level2 level84)
(sum level82 level3 level85)
(sum level82 level4 level86)
(sum level83 level2 level85)
(sum level83 level3 level86)
(sum level84 level2 level86)

(connected l0 l2)
(fuelcost level19 l0 l2)
(connected l0 l3)
(fuelcost level4 l0 l3)
(connected l0 l4)
(fuelcost level13 l0 l4)
(connected l0 l6)
(fuelcost level17 l0 l6)
(connected l0 l7)
(fuelcost level13 l0 l7)
(connected l1 l2)
(fuelcost level22 l1 l2)
(connected l1 l3)
(fuelcost level20 l1 l3)
(connected l1 l4)
(fuelcost level11 l1 l4)
(connected l1 l7)
(fuelcost level3 l1 l7)
(connected l1 l8)
(fuelcost level5 l1 l8)
(connected l2 l0)
(fuelcost level19 l2 l0)
(connected l2 l1)
(fuelcost level22 l2 l1)
(connected l3 l0)
(fuelcost level4 l3 l0)
(connected l3 l1)
(fuelcost level20 l3 l1)
(connected l3 l6)
(fuelcost level6 l3 l6)
(connected l4 l0)
(fuelcost level13 l4 l0)
(connected l4 l1)
(fuelcost level11 l4 l1)
(connected l5 l8)
(fuelcost level2 l5 l8)
(connected l6 l0)
(fuelcost level17 l6 l0)
(connected l6 l3)
(fuelcost level6 l6 l3)
(connected l6 l8)
(fuelcost level7 l6 l8)
(connected l7 l0)
(fuelcost level13 l7 l0)
(connected l7 l1)
(fuelcost level3 l7 l1)
(connected l8 l1)
(fuelcost level5 l8 l1)
(connected l8 l5)
(fuelcost level2 l8 l5)
(connected l8 l6)
(fuelcost level7 l8 l6)

(at t0 l2)
(fuel t0 level86)
(= (total-cost) 0)

(at p0 l3)
(at p1 l2)
)

(:goal
(and
(at p0 l1)
(at p1 l7)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 2
2. (drive t0 l2 l1 level64 level22 level86)
   deleted: (at t0 l2) (fuel t0 level86)
   added: (at t0 l1) (fuel t0 level64)
   goals met: 0 of 2
3. (drive t0 l1 l3 level44 level20 level64)
   deleted: (at t0 l1) (fuel t0 level64)
   added: (at t0 l3) (fuel t0 level44)
   goals met: 0 of 2
4. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 2
5. (drive t0 l3 l1 level24 level20 level44)
   deleted: (at t0 l3) (fuel t0 level44)
   added: (at t0 l1) (fuel t0 level24)
   goals met: 0 of 2
6. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 2
7. (drive t0 l1 l7 level21 level3 level24)
   deleted: (at t0 l1) (fuel t0 level24)
   added: (at t0 l7) (fuel t0 level21)
   goals met: 1 of 2
8. (unload p1 t0 l7)
   deleted: (in p1 t0)
   added: (at p1 l7)
   goals met: 2 of 2
